CSI API ETABS v1
cDesignForces Interface
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
public interface cDesignForces
Public Interface cDesignForces
Dim instance As cDesignForces
public interface class cDesignForces
type cDesignForces =  interface end
The cDesignForces type exposes the following members.
Methods
Name | Description
BeamDesignForces
 Retrieves design forces for an existing designed beam
BraceDesignForces
 Retrieves design forces for an existing designed brace
ColumnDesignForces
 Retrieves design forces for an existing designed column
PierDesignForces
 Retrieves design forces for an existing designed pier
SpandrelDesignForces
 Retrieves design forces for an existing designed spandrel
Top
See Also
Reference
ETABSv1 Namespace